# CreateMaskingRegion Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilledRegion..::..CreateMaskingRegion Method
FilledRegion Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMaskingRegion(Document, ElementId, IList<(Of <<'(CurveLoop>)>>)) | Creates a view-specific masking region from the given boundaries. |
| CreateMaskingRegion(Document, SketchPlane, IList<(Of <<'(CurveLoop>)>>)) | Creates a masking region on a sketch plane in a 3d model family. |

# See Also
FilledRegion Class
FilledRegion Members
Autodesk.Revit.DB Namespace